#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
#include <windows.h>
#include <string.h>

//int main()
//{
//	unsigned char i = 0;//无符号的数与循环结合一定要注意条件。非常容易导致死循环
//	for(i=0; i<=255; i++)
//	{
//		printf("hello,world\n");
//	}
//	return 0;
//}

//int main()
//{
//	char a[1000];//char类型的数值在-128-127之间
//	int i;
//	for(i=0; i<1000; i++)
//	{
//		a[i] = -1-i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}

//int main()
//{
//	unsigned int i;//i不为负 i为-1的时候 补码全1在i看来是个超大的数
//	for(i=9; i>=0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(100);
//	}
//	return 0;
//}

//int main()
//{
//	int i = -20;
//	//10000000000000000000000000010100- 原码
//	//11111111111111111111111111101011- 反码
//	//11111111111111111111111111101100- 补码
//	unsigned j = 10;
//	//00000000000000000000000000001010
//	printf("%d\n", i+j);
//	//11111111111111111111111111101100
//	//00000000000000000000000000001010
//	
//	//11111111111111111111111111110110- 结果 -补码
//	//11111111111111111111111111110101
//	//10000000000000000000000000001010- -10
//	//按补码的形式进行运算，在以有符号整型打印
//	return 0;
//}