#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

//int main()
//{
//	//if(判断表达式) 单独if 单分支
//		//语句;
//	
//	//if(判断表达式) if else判断结构 双分支
//		//语句;
//	//else
//		//语句;
//
//	//多分支与后面switch case选择语句一起讲
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	if (a)//括号里是判断表达是，判断表达式结果为真，则进入if语句打印hehe，如果为假，走else打印haha
//	{
//		printf("hehe\n");
//	}
//	else
//	{
//		printf("haha\n");
//	}
//	return 0;
//}

//int main()
//{
//	int arr[] = { 1,2,3,4,5 };
//	//访问数组里的5元素,并打印出来
//	printf("%d\n", arr[4]);
//	return 0;
//}

//int main()
//{ //int是元素类型  arr1是数组名 后面的[]表述元素个数的
//	int arr1[] = { 1,2,3,4,5 };//数组是相同数据类型元素的集合，这里创建了一个有五个元素，每个元素都是整型的arr1数组
//	int arr2[2] = { 1,2 };//[]里我们主动放了个2进去，就意味着这个数组只能放两个整型元素，而arr1是根据你初始化放的元素来确定元素个数的
//	int arr3[10] = { 0 };//数组如果没有初始化，就是没有用{}为arr赋值，就必须要定义[]这个数组有多少个元素
//	//如果没有定义元素个数，就必须要初始化，[]里的元素个数会根据你的初始化个数来定
//	return 0;
//}

//int main()
//{
//	char arr1[] = "hello, world";//arr[]是一个数组，arr是数组名 []里面是来表示元素个数的
//	char arr2[] = { 'b', 'i', 't' };//数组有三个元素分别是字符b、i、t
//	char arr3[] = { 'b', 'i', 't', '\0' };//数组有四个元素，多arr2一个斜杠0
//	printf("%s\n", arr1);//%s是打印以串字符串，遇到斜杠0停止打印
//	printf("%s\n", arr2);
//	printf("%s\n", arr3);
//}

//int main()
//{
//	int a = 5.5;
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	a += 2;//这里等价于 a = a + 2 -- 把10 + 2的值赋给a
//	printf("%d\n", a);//12
//	return 0;
//}

//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;//连续创建i、a、b、c、d五个变量
//	i = a++ && ++b && d++;
//	printf("a = %d b = %d c = %d d = %d\n", a, b, c, d);
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int b = a++;//a先使用，把10赋值给b，自己再自增(a变成11)，所以b是10
//	printf("b = %d\n", b);//10
//	a = 10;//重新赋10给a 因为a++后 a的值变成了11
//	int c = ++a;//先调整，a变成11后再赋值给c，所以c是11
//	printf("c = %d\n", c);//11
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	if(5<a<=10)//error 如果你想表达a大于5并且小于等于10 应该是这样表达if(a>5 && a<=10)
//	{               //如果你想表达a<5或a>=10 应该是if(a<5 || a>=10)
//		printf("haha\n");//()里的表达错误，编译器报错，代码跑不过去,打印不了，但我这编译器跑的过去，能成功打印出haha
// 	}                    //实际上是不能这样表达的
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int b = 5;
//	printf("%d\n", a && b);//1
//	return 0;
//}

//int main()
//{
//	int a = 5;//0101
//	int b = 3;//0011      0101
//	//按位异或 同0异1     0011  两个0相同是0、1和0不同是1、最后两个1相同是0
//	int i = a ^ b;//      0110 - i的值是6
//	//|按位或 只要有真就是真
//	int c = a | b;//0111 - c的值是7
//	//&按位与 只有两个都是真才为真
//	int ret = a & b;//0001 - ret的值是1
//	return 0;
//}

//int main()
//{
//	int a = 5;
//	//<<常量
//	int ret = a << 1;//0101左移一位变成01010 最左边超出32位的0被丢弃，右边补0
//	printf("%d\n", ret);//10 一般可以认为是乘了个2
//	//如果想右移用>>常量即可，不要脑洞大开<<-常量代表右移，C语言对此操作没有定义
//	int b = 12;
//	ret = b >> 2;//01100 - 011是3 一般可以认为是除了2，右移分为算术右移和逻辑右移 
//	//逻辑右移就是右边舍弃左边补0
//	//算术右移就是右边舍弃左边补符号位，因为正数的符号位是0，所以和逻辑一样，编译器一般是算术右移。
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	printf("%d\n", sizeof(a));//4
//	printf("%d\n", sizeof a);//4
//	printf("%d\n", sizeof(int));//4
//	printf("%d\n", sizeof int);//error错误
//	return 0;
//}

//int main()
//{
//	char ch = 'c';//1
//	short a = 2;//2
//	int b = 4;//4
//	long c = 4;//4
//	float f = 0.0;//4
//	double d = 0.0;//8
//	printf("%d %d %d %d %d %d", sizeof(ch), sizeof(a), sizeof(b), sizeof(c), sizeof(f), sizeof(d));
//	return 0;
//}

//int main()
//{
//	int i = 0;
//	//10110 - 1*2^1 + 1*2^2 + 0*2^3 + 1*2^4 = 22 第n位-1就是它对应的权重、右边是低位
//	int j = 20;//16 + 4  - 10100   如果明白了，不是很大的数我们可以直接写出来，但还是要细心点，毕竟容易错位
//	return 0;
//}

//int main()
//{
//	int i = 5;
//	//i的二进制是0101 从右向左，权位上升，分别是2^0、2^1、2^2、2^3
//	//0*2^3 + 1*2^2 + 0*2^1 + 1*2^0(2的0次方是1) = 5(十进制);
//	//这里我们需要讲一些计算机的单位，其实这里的i是有32个bit位的，由于前面的0无关紧要，省略是ok的
//	//但在内存中还是原原本本的32位存进去的。
//	return 0;
//}
 
//int main()
//{
//	int i = 0;
//	scanf("%d", &i);
//	return 0;
//}